In [1]:
# pandas is also known as data manipuation package

!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   SN     Name  Age    Address       Phone
0   1      Ram   45  Kathmandu  9876564563
1   2    Shyam   23    Chitwan  9756876555
2   3     Hari   34   Bhaktpur  9877878767
3   4    Radha   23    Tinkune  9876453452
4   5  Krishna   23  Baneshwor  9875546343

In [4]:
df = pd.read_csv('data.csv', nrows = 4)
df

   SN   Name  Age    Address       Phone
0   1    Ram   45  Kathmandu  9876564563
1   2  Shyam   23    Chitwan  9756876555
2   3   Hari   34   Bhaktpur  9877878767
3   4  Radha   23    Tinkune  9876453452

In [5]:
# In large dataset using head shows the result from top upto 5 data from dataset

df = pd.read_csv('data.csv')
df.head(3)

   SN   Name  Age    Address       Phone
0   1    Ram   45  Kathmandu  9876564563
1   2  Shyam   23    Chitwan  9756876555
2   3   Hari   34   Bhaktpur  9877878767

In [6]:
# In large dataset using tail shows the result from bottom of dataset

df.tail(1)

   SN     Name  Age    Address       Phone
4   5  Krishna   23  Baneshwor  9875546343

In [7]:
df = pd.read_csv('data.csv', usecols = ['SN','Name','Phone'])
df

   SN     Name       Phone
0   1      Ram  9876564563
1   2    Shyam  9756876555
2   3     Hari  9877878767
3   4    Radha  9876453452
4   5  Krishna  9875546343

In [8]:
df = pd.read_csv('data.csv')
df[['SN','Name','Phone']]

   SN     Name       Phone
0   1      Ram  9876564563
1   2    Shyam  9756876555
2   3     Hari  9877878767
3   4    Radha  9876453452
4   5  Krishna  9875546343

In [9]:
#iloc loc

df = pd.read_csv('data.csv')

In [10]:
df.iloc[2:5]

   SN     Name  Age    Address       Phone
2   3     Hari   34   Bhaktpur  9877878767
3   4    Radha   23    Tinkune  9876453452
4   5  Krishna   23  Baneshwor  9875546343

In [11]:
df.iloc[2:5,0:4]

   SN     Name  Age    Address
2   3     Hari   34   Bhaktpur
3   4    Radha   23    Tinkune
4   5  Krishna   23  Baneshwor

In [12]:
# To make SN a index column

df = pd.read_csv('data.csv',index_col = 'SN')
df

       Name  Age    Address       Phone
SN
1       Ram   45  Kathmandu  9876564563
2     Shyam   23    Chitwan  9756876555
3      Hari   34   Bhaktpur  9877878767
4     Radha   23    Tinkune  9876453452
5   Krishna   23  Baneshwor  9875546343

In [13]:
df = pd.read_csv('data.csv',index_col = 'SN')
df.loc[2:5,'Name':'Address']

       Name  Age    Address
SN
2     Shyam   23    Chitwan
3      Hari   34   Bhaktpur
4     Radha   23    Tinkune
5   Krishna   23  Baneshwor

In [14]:
df[df['Name'] == 'Ram']

   Name  Age    Address       Phone
SN
1   Ram   45  Kathmandu  9876564563

In [15]:
df[df['Address'] == 'Kathmandu']

   Name  Age    Address       Phone
SN
1   Ram   45  Kathmandu  9876564563

In [16]:
df[(df['Address'] == 'Kathmandu') & (df['Age'] >33)]

   Name  Age    Address       Phone
SN
1   Ram   45  Kathmandu  9876564563

In [17]:
df[(df['Address'] == 'Kathmandu') | (df['Age']>33)]

    Name  Age    Address       Phone
SN
1    Ram   45  Kathmandu  9876564563
3   Hari   34   Bhaktpur  9877878767

In [22]:
import pandas as pd
data = {'Name':['Ram','Shyam','Hari'],
       'Age':[23,45,36],
        'Address':["Kathmandu","Bhaktapur","Chitwan"]
       }
df = pd.DataFrame(data)
df.to_csv('data1.csv')
df

    Name  Age    Address
0    Ram   23  Kathmandu
1  Shyam   45  Bhaktapur
2   Hari   36    Chitwan

In [23]:
import csv
data = [['Name','Age','Address'],
       ["Ram",23,"Kathmandu"],
       ["Shyam",34,"Chitwan"],
       ["Hari",45,"Bhaktapur"]
       ]
file = open('data2.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [39]:
import csv

csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Kathmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]

csvfile = open("data3.csv", 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()   # write header/column of the table
for data in dict:
    writer.writerow(data)  # write row of the table

csvfile.close()

In [40]:
import csv

csvfile = open('data3.csv','r')
reader = csv.DictReader(csvfile)
for row in reader:
    print(row)
    
csvfile.close()

{'Name': 'Aayush', 'Age': '23', 'Address': 'Kathmandu'}
{'Name': 'Shyam', 'Age': '33', 'Address': 'Patan'}

In [41]:
import csv

data = []
csvfile = open('data3.csv','r')
reader = csv.DictReader(csvfile)
for row in reader:
    data.append(row)
data

[{'Name': 'Aayush', 'Age': '23', 'Address': 'Kathmandu'},
 {'Name': 'Shyam', 'Age': '33', 'Address': 'Patan'}]

In [45]:
data.append({'Name': 'Hari', 'Age': '43', 'Address': 'Tinune'})
data

[{'Name': 'Aayush', 'Age': '23', 'Address': 'Kathmandu'},
 {'Name': 'Shyam', 'Age': '33', 'Address': 'Patan'},
 {'Name': 'Hari', 'Age': '43', 'Address': 'Tinune'},
 {'Name': 'Hari', 'Age': '43', 'Address': 'Tinune'}]

In [46]:
csvfile = open("data3.csv", 'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()  
for data in dict:
    writer.writerow(data)

csvfile.close()

In [49]:
df1 = pd.read_csv('data3.csv')
df1

     Name  Age    Address
0  Aayush   23  Kathmandu
1   Shyam   33      Patan

In [55]:
df2 = pd.DataFrame([
    {'Name':'Ram','Age':23,'Address':'Kathmandu'}
])
df2

  Name  Age    Address
0  Ram   23  Kathmandu

In [56]:
# Key of both data frame should be same and same number of column to concatinate

df = pd.concat([df1,df2])
df

     Name  Age    Address
0  Aayush   23  Kathmandu
1   Shyam   33      Patan
0     Ram   23  Kathmandu

In [57]:
df = pd.concat([df1,df2])
df.to_csv('new_data.csv')

In [58]:
df

     Name  Age    Address
0  Aayush   23  Kathmandu
1   Shyam   33      Patan
0     Ram   23  Kathmandu

In [63]:
# To add new column in dataset

df['Phone'] = [9876897867,9087689876,9087643232]
df['Blood Group'] = ['A+','B+','O+']

In [66]:
df

     Name  Age    Address       Phone Blood Group
0  Aayush   23  Kathmandu  9876897867          A+
1   Shyam   33      Patan  9087689876          B+
0     Ram   23  Kathmandu  9087643232          O+

In [80]:
# To delete column and rows. axis = 0 is row and axis =1 is column

df1 = pd.read_csv('data3.csv',index_col='Name')
df = df1.drop(['Shyam'],axis=0)
df

        Age    Address
Name
Aayush   23  Kathmandu

In [86]:
df1 = pd.read_csv('data2.csv',index_col='Name')
df = df1.drop(['Shyam'],axis=0)
df

      Age    Address
Name
Ram    23  Kathmandu
Hari   45  Bhaktapur

In [88]:
df = pd.read_csv('data2.csv',index_col='Name')
df = df.drop(['Address'],axis=1)
df

       Age
Name
Ram     23
Shyam   34
Hari    45